tap "charmbracelet/tap"
tap "siddhantac/puffin"
tap "valkyrie00/bbrew"
# All-in-one AI-Powered CLI Chat & Copilot
brew "aichat"
# Easily create and use cli based on bash script
brew "argc"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Record and share terminal sessions
brew "asciinema"
# Terminal bandwidth utilization tool
brew "bandwhich"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Console Matrix
brew "cmatrix"
# Generates code snapshots in various formats
brew "codesnap"
# Modern diagram scripting language that turns text to diagrams
brew "d2"
# Diff that understands syntax
brew "difftastic"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Easily install prebuilt binaries from GitHub
brew "eget"
# Run arbitrary commands when files change
brew "entr"
# Calculator REPL, similar to bc(1)
brew "eva"
# Command-line batch renaming tool
brew "f2"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Fast partial replacement for the codemod tool
brew "fastmod"
# Significantly faster alternative to the classic Unix cp(1) command
brew "fcp"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GitHub command-line tool
brew "gh"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Command-line hex viewer
brew "hexyl"
# Easy plain text accounting with command-line, terminal and web UIs
brew "hledger"
# Improved top (interactive process viewer)
brew "htop"
# JQ clone focussed on correctness, speed, and simplicity
brew "jaq"
# Command-line pager for JSON data
brew "jless"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# GUI for vim, made for macOS
brew "macvim"
# Utility for directing compilation
brew "make"
# Nice to use pager for humans
brew "moar"
# Command-line music player client for mpd
brew "mpc"
# Music Player Daemon
brew "mpd", restart_service: :changed
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# No Nonsense Neovim Client in Rust
brew "neovide"
# Command-line Git information tool
brew "onefetch"
# Shell command parallelization utility
brew "parallel"
# File download client
brew "pget"
# Modern replacement for ps written in Rust
brew "procs"
# Unit conversion tool and library written in rust
brew "rink"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Move files and directories to the trash
brew "rmtrash"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Modern and pretty fancy file manager for the terminal
brew "superfile"
# TUI to view and query tabular files (CSV,TSV, Parquet, etc.)
brew "tabiew"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Maintained ctags implementation
brew "universal-ctags"
# Tool for writing command-line pipes with instant live preview
brew "up"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Your CLI home video recorder
brew "vhs"
# Execute commands when watched files change
brew "watchexec"
# Internet file retriever
brew "wget"
# CSV CLI magician written in Rust
brew "xan"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Generate images of code and terminal output.
brew "charmbracelet/tap/freeze"
# A beautiful and simple terminal dashboard for hledger
brew "siddhantac/puffin/puffin"
# A simple TUI tool to make your homebrew bold.
brew "valkyrie00/bbrew/bbrew"
# Application uninstaller
cask "appcleaner"
# User-friendly GUI app for Homebrew
cask "applite"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Photography workflow application and raw developer
cask "darktable"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Free and open-source media player
cask "iina"
# Clipboard manager
cask "maccy"
# Programmable solid 3D CAD modeller
cask "openscad"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# REST, GraphQL and gRPC client
cask "yaak"
# Multiplayer code editor
cask "zed"
