# All-in-one AI-Powered CLI Chat & Copilot
brew "aichat"
# Easily create and use cli based on bash script
brew "argc"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Hacker News in your terminal
brew "circumflex"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Console Matrix
brew "cmatrix"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Modern diagram scripting language that turns text to diagrams
brew "d2"
# Diff that understands syntax
brew "difftastic"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Easily install prebuilt binaries from GitHub
brew "eget"
# Run arbitrary commands when files change
brew "entr"
# Calculator REPL, similar to bc(1)
brew "eva"
# Command-line batch renaming tool
brew "f2"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Fast partial replacement for the codemod tool
brew "fastmod"
# Significantly faster alternative to the classic Unix cp(1) command
brew "fcp"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Banner-like program prints strings as ASCII art
brew "figlet"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go formatter that additionally inserts import statements
brew "goimports"
# Language server for the Go language
brew "gopls"
# Tool to convert a Wallpaper's color scheme / palette
brew "gowall"
# Command-line hex viewer
brew "hexyl"
# Fast and powerful log viewer and processor
brew "hl"
# Easy plain text accounting with command-line, terminal and web UIs
brew "hledger"
# Improved top (interactive process viewer)
brew "htop"
# Command-line pager for JSON data
brew "jless"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Access large language models from the command-line
brew "llm"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Utility for directing compilation
brew "make"
# Nice to use pager for humans
brew "moar"
# Command-line music player client for mpd
brew "mpc"
# Music Player Daemon
brew "mpd", restart_service: :changed
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Control nvim processes using `nvr` command-line tool
brew "neovim-remote"
# Command-line Git information tool
brew "onefetch"
# Shell command parallelization utility
brew "parallel"
# File download client
brew "pget"
# Modern API client that lives in your terminal
brew "posting"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Modern replacement for ps written in Rust
brew "procs"
# Unit conversion tool and library written in rust
brew "rink"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Move files and directories to the trash
brew "rmtrash"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Cross-shell prompt for astronauts
brew "starship"
# Modern and pretty fancy file manager for the terminal
brew "superfile"
# TUI to view and query tabular files (CSV,TSV, Parquet, etc.)
brew "tabiew"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Unicode database query tool for the command-line
brew "uni"
# Maintained ctags implementation
brew "universal-ctags"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Your CLI home video recorder
brew "vhs"
# Execute commands when watched files change
brew "watchexec"
# Internet file retriever
brew "wget"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Application uninstaller
cask "appcleaner"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Photography workflow application and raw developer
cask "darktable"
# Utility that prevents the system from going to sleep
cask "domzilla-caffeine"
# Waterfall-style image viewer
cask "flowvision"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Free and open-source media player
cask "iina"
# Neovim Client
cask "neovide-app"
# Finds large, unwanted files and deletes them
cask "omnidisksweeper"
# Programmable solid 3D CAD modeller
cask "openscad"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# AI image upscaler
cask "upscayl"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm@nightly"
# REST, GraphQL and gRPC client
cask "yaak"
