tap "siddhantac/puffin"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Record and share terminal sessions
brew "asciinema"
# Terminal bandwidth utilization tool
brew "bandwhich"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Modern diagram scripting language that turns text to diagrams
brew "d2"
# Terminal visual disk space navigator
brew "diskonaut"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Easily install prebuilt binaries from GitHub
brew "eget"
# Calculator REPL, similar to bc(1)
brew "eva"
# Fast partial replacement for the codemod tool
brew "fastmod"
# Significantly faster alternative to the classic Unix cp(1) command
brew "fcp"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# Command-line hex viewer
brew "hexyl"
# Easy plain text accounting with command-line, terminal and web UIs
brew "hledger"
# Improved top (interactive process viewer)
brew "htop"
# Command-line pager for JSON data
brew "jless"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# GUI for vim, made for macOS
brew "macvim"
# Command-line music player client for mpd
brew "mpc"
# Music Player Daemon
brew "mpd", restart_service: :changed
# Shell command parallelization utility
brew "parallel"
# Modern replacement for ps written in Rust
brew "procs"
# File browser
brew "ranger"
# Unit conversion tool and library written in rust
brew "rink"
# Move files and directories to the trash
brew "rmtrash"
# Cross-shell prompt for astronauts
brew "starship"
# TUI to view and query tabular files (CSV,TSV, Parquet, etc.)
brew "tabiew"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Maintained ctags implementation
brew "universal-ctags"
# Tool for writing command-line pipes with instant live preview
brew "up"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Execute commands when watched files change
brew "watchexec"
# CSV CLI magician written in Rust
brew "xan"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# A beautiful and simple terminal dashboard for hledger
brew "siddhantac/puffin/puffin"
# User-friendly GUI app for Homebrew
cask "applite"
# Photography workflow application and raw developer
cask "darktable"
cask "font-fira-code"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Free and open-source media player
cask "iina"
# Programmable solid 3D CAD modeller
cask "openscad"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Multiplayer code editor
cask "zed"
